src/Documents/Запись/Запись.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Запись</name>
  <registerRecords>InformationRegister.ИсторияЗаписей</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Длительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ЦеныНаУслуги/ЦеныНаУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНаУслуги</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/Запись/Forms/ФормаДокумента/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьИнформациюОбУслуге(Услуга, Дата)

	ВозвращаемаяУслуга = Новый Структура();
	ВозвращаемаяУслуга.Вставить("Длительность", 0);
	ВозвращаемаяУслуга.Вставить("Цена", 0);

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Услуги.Длительность КАК Длительность,
		|	ЕСТЬNULL(ЦеныНаУслугиСрезПоследних.Цена, 0) КАК Цена
		|ИЗ
		|	Справочник.Услуги КАК Услуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНаУслуги.СрезПоследних(&Дата, Услуга = &Услуга) КАК ЦеныНаУслугиСрезПоследних
		|		ПО Услуги.Ссылка = ЦеныНаУслугиСрезПоследних.Услуга
		|ГДЕ
		|	Услуги.Ссылка = &Услуга";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Услуга", Услуга);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		ЗаполнитьЗначенияСвойств(ВозвращаемаяУслуга, ВыборкаДетальныеЗаписи);
		
		Возврат ВозвращаемаяУслуга;
	КонецЕсли;
			
КонецФункции // ПолучитьИнформациюОбУслугах()

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	ТекСтрока = Элементы.Услуги.ТекущиеДанные;
	ИнформацияОбУслуге = ПолучитьИнформациюОбУслуге(ТекСтрока.Услуга, Объект.Дата);
	ТекСтрока.Стоимость = ИнформацияОбУслуге.Цена;
	ТекСтрока.Длительность = ИнформацияОбУслуге.Длительность;
КонецПроцедуры                               


&НаКлиенте
Процедура ПересчетДанныхДокумента()	
	Попытка
	
		Сумма = 0;
		Длительность = 0;
		
		Для каждого ЭлементУслуги Из Объект.Услуги Цикл
			 Сумма = Сумма + ЭлементУслуги.Стоимость;
			 Длительность = Длительность + ЭлементУслуги.Длительность;
		КонецЦикла;
		 
		Объект.Длительность = Длительность;
		Объект.Сумма = Сумма;
		
	Исключение
	
	КонецПопытки;	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьНеизменяемыеПоля();
КонецПроцедуры

Процедура УстановитьНеизменяемыеПоля()
	Элементы.Сумма.ТолькоПросмотр = Истина;
	//Элементы.Длительность.ТолькоПросмотр = Истина;	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	ПересчетДанныхДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.ДатаОкончания = Объект.Дата + Объект.Длительность * 60;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Изменение_Запись"); 
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Цвет = Новый ХранилищеЗначения(Цвет);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Цвет = ТекущийОбъект.Цвет.Получить();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		Цвет = WebЦвета.БледноЛиловый
	КонецЕсли;
КонецПроцедуры
